package chapter_05;

public class p129_Student {     // 접근제어자 : public 
                                // 클래스를 만드는 예약어 : class
                                // 클래스 이름 : p129_Student
                                // 클래스 이름은 대문자로 시작한다. (coding convension)
    
                                // 객체의 속성.
    int studentID;              // int형 변수 studentID(학번)를 선언           // 멤버변수
    String studentName;         // String형 변수 studentName(학생이름) 선언    // 멤버변수
    int grade;                  // int형 변수 grade(학년) 선언                 // 멤버변수
    String address;             // String형 변수 address(사는곳) 선언          // 멤버변수
    
    
    /*
     * <객체지향 프로그래밍>
     * 
     * 객체를 기반으로 하는 프로그램
     * 
     * 절차지향프로그래밍언어는 C언어가 있다.
     * 절차지향은 일어나는 일을 시간순으로 프로그래밍 하는것.
     * 
     * 객체지향은 객체를 정의하고 객체 간 협력을 프로그래밍.
     * 
     * 객체를 정의하고, 각 객체간 기능을 제공, 객체간 협력을 구현.
     */
    
    /*
     * <클래스>
     * 
     * 객체지향 프로그램은 클래스를 기반으로 프로그래밍한다.
     * 
     * 클래스는 객체의 속성과 기능을 코드로 구현.
     * 
     * 객체를 클래스로 구현하는것을 '클래스를 정의한다'라고 표현 한다.
     * 
     * 클래스 속성은 특성이라고도 하며,
     * 클래스 내부에 변수로 선언.
     * 
     * 이렇게 선언하는 클래스 속성을 '멤버변수'라고 한다.
     */
    
    /*
     * <클래스 정의하는 문법>
     * 
     * (접근제어자)class 클래스 이름 {
     *      멤버변수;
     *      메서드;
     * }     
     */
    
    
    
}
